[{
    "id":1,
    "name": "Haridasu Renuka Sri",
    "exp":"I am placed at JPMorgan Chase & Co in the field of Coding. During the test, we\r\nwere asked to solve two questions on mathematics in one hour. After completion\r\nof the test, we were supposed to record two videos on two questions, where we\r\ntalked about our aim and developing technology. During the interview, the\r\ninterviewers asked about ourselves and examined us on our prior experiences,\r\nskillset and completed projects. Having good knowledge of Data Structures and\r\nAlgorithms and preparing attractive resumes will help in clearing the selection\r\nprocess. Thank You!! All the Best!!\r\n"
},
{
    "id":2,
    "name": "Harsh Sanghai",
    "exp":"I got placed in Mastercard in the field of Coding. The test questions were mainly\r\nfocused on basic data structures and algorithm topics. The overall selection\r\nprocess was smooth and good. Having a piece of good knowledge of Data\r\nStructures, DBMS and OS. Solving puzzles and having project-based experience\r\nwill help in clearing the selection process. Thank You!! All the Best!!\r\n"
},
{
    "id":3,
    "name": "Yash Goplani",
    "exp":"I got placed in Mastercard in the field of Coding. Two questions were asked\r\nduring the test round, the questions were based on classic competitive\r\nprogramming. One hour was given to complete the test. After the test, during the\r\ninterview round, interviewers focused on the technical HR based questions. The\r\ntechnical questions were based on OOP and the experience from projects. The\r\nHR questions were basically about the company. Having a 2-way conversation\r\nwith interviewers instead of a Q\/A session would help in the selection process.\r\nThank You!! All the Best!!\r\n"
},
{
    "id":4,
    "name": "Abhinav Kumar",
    "exp":"Placed at Credit Suisse. The selection process was done in two rounds. In the\r\ntest round, the questions were mainly asked on Aptitude, Verbal, DBMS, OOPs,\r\netc. Interviewers questioned on technical topics like DBMS and OOPs and a few\r\nquestions based on the Resume. I would like to thank the people in the TnP\r\nsection, who did wonderful job in helping students in their future endeavours.\r\nFollowing the guidelines of the TnP section will help a lot in the placement\r\nprocedure. Thank You!! All the Best!!"
},
{
    "id":5,
    "name": "Garvit Saini",
    "exp":"Got placed in the JPMorgan Chase & Co as part of a pre-placement offer. The\r\ncompany offered PPO for all the interns, who worked in their company. Thank\r\nYou!! All the Best!!\r\n"
},
{
    "id":6,
    "name": "Harsh Kumar",
    "exp":"I got placed at Infosys. The test was based on coding. The questions of the test\r\nwere mainly based on graphs. During the interview, questions were focused on\r\nthe technical side like on DP and OOPs. Also, was asked to write code on an\r\neditor and pass all the 5 cases of the question of the technical round. The\r\nselection process was unbiased and the best opportunity for students. Thank\r\nYou!! All the Best!!"
},

{
    "id":7,
    "name": "Joyit Gupta",
    "exp":"Got a placement offer from John Deere. In the test round, the questions mainly\r\nfocused on coding and aptitude (7 MCQs and 2 coding questions). The students\r\nshortlisted after the test were sent to the interview round. During this round,\r\nquestions were asked about my technical skills and resume. Thank You!! All the\r\nBest!!"
},
{
    "id":8,
    "name": "Ismail",
    "exp":"I got placed in John Deere, an American manufacturing company. During the test\r\nround, mainly questions were focused on coding, DSA and core computer\r\nscience concepts. During the technical round, I was asked about DSA and other\r\ncoding skills and during the HR interview, they mainly focused on my hobbies,\r\nstrengths, etc. The selection process was conducted successfully. Having an\r\nopen mind and interactive session will help during the interview round. Thank\r\nYou!! All the Best!!"
},
{
    "id":9,
    "name": "Charmi Shah",
    "exp":"Got placed in Ugam Solutions, an Analytics company. I got a pre-placement offer\r\nfrom the company. Working hard and having interactive sessions with company\r\nemployees and employers during your internship period will help in getting a\r\nPPO. Thank You!! All the Best!!\r\n"
},
{
    "id":10,
    "name": "NUNNA NAGA SURYA SAI DAIVIK",
    "exp":"Got a placement offer from John Deere. The selection process was conducted in\r\ntwo rounds, tests and interviews. During the test round, the problems were asked\r\non database management systems, operating systems and data structures and\r\nalgorithms. During the technical round of the interview, I was asked about my\r\nprojects and coding skills. And during the HR interview, I was asked to tell about\r\nmyself and a few questions about the company. Having a piece of good\r\nknowledge of coding will help during the selection process. Thank You!! All the\r\nBest!!"
},
{
    "id":11,
    "name": "Devarakonda Mohan Durga Sai Raja",
    "exp":"Got placed in the John Deere company. The selection process was conducted in\r\ntwo rounds, tests and interviews. During the test round, the problems were asked\r\non database management systems, operating systems and data structures and\r\nalgorithms. During the technical round of the interview, I was asked about my\r\nprojects, database management systems, and coding skills. And during the HR\r\ninterview, I was asked to tell about myself and a few questions about my habits\r\nand strengths. Having good knowledge of coding will help during the selection\r\nprocess. Thank You!! All the Best!!\r\n"
},
{
    "id":12,
    "name": "Jaimin Patel",
    "exp":"Got placed in Deutsche Bank, Germany. During the selection process, the bank\r\nmainly focused on students’ coding skills. During the test round, the problems\r\nwere asked on DBMS, OOPS, OS, and computer networks. During the technical\r\nround, I was asked to program a chessboard with 0 and 1, and merge sort on\r\nDBMS and OOPs. During the interview, the interviewers mainly focussed on my\r\nresume, personal projects, coding skills and some HR questions. The selection\r\nwas very smooth and unbiased. Thank You!! All the Best!!"
},
{
    "id":13,
    "name": "Bhavya Shah",
    "exp":"Got placement offers from JPMorgan and Chase, Mastercard. The selection\r\nprocess in both was smooth. The first round was a coding contest that had 2\r\nquestions, from basic topics of data structures like arrays, stacks and trees.\r\nRound 2 is a 2-day hackathon, where we were supposed to work in teams to\r\nprovide solutions to some problems of NGOs and present the same before the\r\ninterviewers. During the HR interview, JPMC tests whether students can work in\r\ngroups to provide optimal solutions and checks whether students can adapt to\r\nnew stacks or coding skills. Thank You!! All the Best!!"
},
{
    "id":14,
    "name": "Vrunda Patel",
    "exp":"Got a placement from Mastercard. The selection process was a once in a lifetime\r\nexperience. The test was mainly focused on competitive programming. During\r\nthe interview, the questions focused on coding, technical and communication\r\nskills and also were asked about my projects and a few HR questions. Thank\r\nYou!! All the Best!!\r\n"
},
{
    "id":15,
    "name": "Siddharth Rajesh Damor",
    "exp":"Got placed in Ugam Solutions. I was offered a pre-placement offer. There was a\r\ngroup discussion round, where a few students were given a topic and asked to\r\nshare their thoughts on the same. During the technical round, we were asked\r\nabout our skills and experience from college projects. During the HR interview,\r\nthe questions were asked about the company. Having a good knowledge of your\r\ncoding skills and also about the company will help in the selection process.\r\nThank You!! All the Best!!\r\n"
},
{
    "id":16,
    "name": "Meet Soni",
    "exp":"Got placed in Ugam Solutions, an Analytics company. The selection process was\r\nsmooth. The first was a group discussion, where a GD is conducted between 10\r\naspirants on a situation based topic and aspirants need to share their views or\r\nthoughts with the group. The technical round was mainly focused on basic\r\nquestions related to the panda's data frame, Django and flask questions, and one\r\neasy array-based coding problem. The HR interview was based on my resume.\r\nThank You!! All the Best!!\r\n"
},
{
    "id":17,
    "name": "Hardik Vinodprasad Upadhyay",
    "exp":"Got a placement offer from D. E. Shaw & Co Hedge fund company. The test was\r\nmainly asked about DBMS, DSA, Aptitude, etc. During the technical round,\r\nquestions were asked on graphs, trees, puzzles, and Greedy, Dynamic\r\nProgramming. Having a piece of good knowledge of data structures and\r\ndatabase management systems will help a lot during the selection process.\r\nThank You!! All the Best!!"
},
{
    "id":18,
    "name": "Shubham Kulkarni",
    "exp":"Got placed in Axxela services ltd. The test was based on Mathematics and\r\nLogical reasoning. And the second activity was a group discussion, a trading\r\ngame was given to 10 students, where one had to make maximum profit by\r\nexecuting trades. Having good knowledge of trading and a few coding skills will\r\nhelp a lot during the selection procedure. Thank You!! All the Best!!"
},
{
    "id":19,
    "name": "Dhruvi Bharatbhai Patel",
    "exp":"Got placed in John Deere. I was offered a pre-placement offer. An HR interview\r\nwas conducted after getting the offer. During the HR interview, questions were\r\nmainly focused on my resume and about the company. Doing hard and good\r\nwork will help a lot in getting a PPO. Thank You!! All the Best!!\r\n"
},
{
    "id":20,
    "name": "Keyur Tarsariya",
    "exp":"Got a placement from Mastercard. In the test, we were given 2 problems on\r\ndynamic programming and leetcode. In the technical round, a panel of two\r\nexperts have taken the interviews with students. The panel focused on my\r\nresume and then shifted their focus onto my skill set and asked a few questions\r\non programming concepts. The Mastercard hiring process was smooth and had a\r\nwonderful experience during the selection procedure. Thank You!! All the Best!!"
}
]